[bits 64]

global quick_sort

section .text

; void quick_sort(int *array, long count)
;
; Соглашение вызова (System V AMD64 ABI):
;   RDI - указатель на начало массива 32-битных целых чисел (int32_t*)
;   RSI - количество элементов массива (int64_t)
;
; Функция ничего не возвращает, результат сортировки должен быть записан
; непосредственно в исходный массив.
quick_sort:
; ------------------------------------------------------------------------------
;                                   ЗАДАНИЕ
;
; Реализовать алгоритм сортировки Quick Sort, отсортировав массив по
; возрастанию.
;
; Если потребуются регистры RBX, RBP, R12-R15 - не забудьте сохранить и
; восстановить их исходные значения (callee-saved регистры).

    ; Код решения задачи

    ret
;
; ------------------------------------------------------------------------------
